<!--  微页面  -->
<template>
    <div class="help-page">
        <el-collapse v-model="activeNames" @change="handleChange">
            <p class="title"><i class="icon-title"></i>关于账号</p>
            <el-collapse-item title="如何获得账号" name="1">
                <p>已开通服务的高校学生，本人学号即为登录应用使用的账号。学生在登录应用前，需要先通过【光氧运动】认证服务号将自身的账号激活，才能正常登录。具体激活流程请看“新用户激活账号”。</p>
            </el-collapse-item>
            <el-collapse-item title="新用户如何激活账号" name="2">
                <p>1. 打开微信，关注【光氧运动】认证服务号。</p>
                <p>2. 点击公众号自动回复内的【激活账号】链接，或者点击公众号底部菜单栏内的【激活账号】选项，进入【学籍信息验证】页面。</p>
                <p>3. 在【学籍信息验证】页面，选择已开通服务的学校，输入本人的学号与姓名。点击【下一步】按钮。若信息填写正确，则页面出现“验证成功”的提示弹窗，弹窗消失后，进入【输入密码】页面。</p>
                <p>4. 在【输入密码】页面，输入两次密码后，点击【提交】按钮。若信息填写正确，则页面出现“账号成功激活”的提示弹窗，弹窗消失后，进入【应用宝-微下载】页面。</p>
                <p>5. 下载并安装本应用。</p>
            </el-collapse-item>
            <el-collapse-item title="首次登录应用，绑定设备ID" name="3">
                <p>1. 设备成功安装应用后，用户打开应用，进入【登录】页面。</p>
                <p>2. 用户在【登录】页面，选择已开通服务的学校，输入本人的学号与姓名。点击【下一步】按钮。若信息填写正确，则进入【首页】。</p>
                <p>3. 用户首次登录应用成功后，系统会将首次登录应用时使用的设备ID与学号做绑定。已绑定设备ID的学号，只支持使用本设备登录应用。而已绑定学号的设备，不支持其他学生的学号，在本设备上登录。</p>
                <p>4. 如果用户在首次登录成功后，想更换设备来使用应用，请向官方微信【光氧运动】认证服务号发起客服咨询。</p>
                <!-- <p>5. 线下服务站点的地址为：暂空。</p>
                <p>6. 工作时间（周一至周五 8:00~18:00）。</p> -->
            </el-collapse-item>
            <el-collapse-item title="如何切换账号" name="4">
                为了数据安全，光氧运动App不支持学生切换账号使用应用。
            </el-collapse-item>
            <el-collapse-item title="如何修改密码" name="5">
                <p>1. 打开微信，进入【光氧运动】认证服务号。</p>
                <p>2. 点击公众号底部菜单栏内的【修改密码】选项，进入【学籍信息验证】页面。</p>
                <p>3. 在【学籍信息验证】页面，选择已开通服务的学校，输入本人的学号与姓名。点击【下一步】按钮。若信息填写正确，则页面出现“验证成功”的提示弹窗，弹窗消失后，进入【修改密码】页面。</p>
                <p>4. 在【输入密码】页面，输入两次密码后，点击【提交】按钮。若信息填写正确，则页面出现“密码修改”的提示弹窗，</p>
            </el-collapse-item>

            <p class="title"><i class="icon-title"></i>关于运动</p>
            <el-collapse-item title="有哪些手机内置记步传感器" name="21">
                <div class="content">
                    <p><img src="static/models.png" alt="" width="100%"></p>
                </div>
            </el-collapse-item>
            <el-collapse-item title="跑前准备" name="20">
                <div class="content">
                    <p>1. 请保持设备网络畅通，保证手机设备的蜂窝移动网络处于打开状态，或者设备已经连上WiFi网络并且通信正常。否则在运动过程中，运动数据无法成功提交，影响运动达标。</p>
                    <p>2. 保证手机设备内存足够，或者将应用加入手机自动清理内存白名单，否则在运动过程中，可能出现因为手机内存不足，导致应用被手机系统误杀的情况，造成运动中断。</p>
                </div>
            </el-collapse-item>
            <el-collapse-item title="如何完成一次运动" name="6">
                <div class="content">
                    <p>1. 在【首页】内，点击任意一个运动方式，进入【运动详情页】。</p>
                    <p>2. 如果手机没有给予应用获得地理位置信息的授权，在用户进入【运动详情页】后，应用会向用户请求获取地理位置信息授权。</p>
                    <p>3. 用户开始进行运动前，请确保手机的GPS定位处于打开状态。</p>
                    <p>4. 在【运动详情页】页，通过页面顶部悬浮弹窗，即可查看本次运动需要达到的运动指标。点击<i class="fa fa-compress" aria-hidden="true"></i>，即可收缩悬浮弹窗。</p>
                    <p><img src="static/img1.jpg" alt="" width="100%"></p>
                    <p>5. 点击【开始运动】按钮，开始进行运动。</p>
                    <p>6. 应用支持用户在锁屏状态下进行运动。</p>
                    <p>7. 运动开始后，若需要结束运动，向右滑动<img src="static/img2.jpg" alt="" width="100%"></p>
                    <p>8. 运动结束后，点击【查看锻炼成果】按钮，进入【锻炼成果】页面，查看本次运动的成果。</p>
                    <p>9. 在【锻炼成果】页面，用户可以看到本次运动的运动方式、达标状态、完成距离、耗时、速度、消耗热量以及运动轨迹。</p>
                </div>
            </el-collapse-item>
            <el-collapse-item title="为什么数据/轨迹不准确" name="7">
                <p class="content-indent">一般情况下，是因为跑步过程中某段路程上的 GPS 信号不好或系统受到了干扰，如进入高楼之间、高架桥附近、隧道之内、高大树木遮盖的区域，或乌云之下，此时的表现有：界面上信号为红色或灰色、系统提示信号糟糕或信号无。</p>
                <p class="content-indent">对某一部分手机而言，如果跑步过程拨打或接听电话，也会导致系统无法获取 GPS 信号，进而导致对应时段内的轨迹和数据不准确。</p>
                <p class="content-indent">不同手机 GPS 模块的硬件水平不同，也会影响获得 GPS 的准确性。</p>
                <p class="content-indent">另外，Android 用户还可以检查一下手机系统中是否授予了光氧运动定位的权限。（具体可按品牌机型查看设置方法）。</p>
            </el-collapse-item>
            <el-collapse-item title="为什么锁屏或者后台运行后，经常无法记录轨迹/自动退出" name="8">
                <div class="content">
                    <p class="content-indent">需要对手机进行设置。</p>
                    <p class="content-indent">如果手机里安装了安全应用或者省电类应用，需要在该应用中将 光氧运动App 加入内存清理白名单以及省电保护名单。</p>
                    <p class="content-indent">具体机型的设置见下文。</p>
                    <el-collapse v-model="activeNames2">
                        <el-collapse-item title="iphone 手机设置方法" name="1">
                            <p class="content-indent">请打开「设置」-「通用」-「允许后台程序刷新」，看此项是否已经打开。若打开，请检查 光氧运动App 那一项是否打开。若未打开手机系统会自动关闭后台运行的进程。</p>
                            <p><img src="static/iphone.jpg" alt="" width="100%"></p>
                        </el-collapse-item>
                        <el-collapse-item title="OPPO 手机设置方法" name="2">
                            <p>OPPO R9：</p>
                            <p>打开「设置」-「省电池」，确保 光氧运动App 的「后台冻结」和「检测到异常时自动优化」为关闭状态。</p>
                            <p><img src="static/oppoR9.jpg" alt="" width="100%"></p>
                            <p>OPPO R7: 打开「安全中心」-「电量节省」-「纯净后台名单设置」，确保 光氧运动App 的开关处理打开状态。</p>
                            <p><img src="static/oppoR7.jpg" alt="" width="100%"></p>
                            <p><img src="static/oppoR7-2.jpg" alt="" width="100%"></p>
                        </el-collapse-item>
                        <el-collapse-item title="Vivo 手机设置方法" name="3">
                            <p>打开「i 管家」-「省电管理」，确保处理「正常模式」；打开「后台高耗电」，确保光氧运动App 处于打开状态。</p>
                            <p><img src="static/vivo.jpg" alt="" width="100%"></p>
                        </el-collapse-item>
                        <el-collapse-item title="华为手机设置方法" name="4">
                            <p>打开「设置」-「省电管理」-「耗电详情」-「锁屏后继续运行」，确保光氧运动App 处于打开状态。</p>
                            <p><img src="static/huawei.jpg" alt="" width="100%"></p>
                        </el-collapse-item>
                        <el-collapse-item title="小米手机设置方法" name="5">
                            <p>MIUI 8.0，解除省电限制：打开「设置」-「电量和性能」-「省电优化」，在「应用智能省电」中，将光氧运动App 设置成「无限制」和「允许定位」。</p>
                            <p><img src="static/xiaomi1.jpg" alt="" width="100%"></p>
                            <p><img src="static/xiaomi2.jpg" alt="" width="100%"></p>
                            <p>还要打开「省电优化」-「设置」，将「锁屏断开数据」调为「从不」状态。</p>
                            <p><img src="static/xiaomi7.png" alt="" width="100%"></p>
                            <p>MIUI 8.0，加入内存清理白名单：点击手机上的物理「菜单」按钮，将光氧运动App向下拉动至露出锁图案后松开，图标右上方出现橙色锁，即添加白名单成功。</p>
                            <p><img src="static/xiaomi3.jpg" alt="" width="100%"></p>
                            <p>MIUI 7.0：</p>
                            <p>1.打开「安全中心」-「电量」-「省电模式」，设置成「我的模式」 （如果没有显示「我的模式」选项，则需要先点击「智能省电模式」，才会出现「我的模式」选项）</p>
                            <p><img src="static/xiaomi4.jpg" alt="" width="100%"></p>
                            <p>2.打开「设置」-「其他高级设置」-「神隐模式」，设置为关闭状态</p>
                            <p><img src="static/xiaomi5.jpg" alt="" width="100%"></p>
                            <p>若「神隐模式」为标准状态，则在「已安装应用」中，将 光氧运动App 设置成「无限制」和「允许定位」
                            </p>
                            <p><img src="static/xiaomi6.jpg" alt="" width="100%"></p>
                        </el-collapse-item>
                        <el-collapse-item title="魅族手机设置方法" name="6">
                            <p>打开「设置」-「电量管理」-「省电优化」，在保持运行的耗电应用中，确保 光氧运动App 为打开状态</p>
                            <p><img src="static/meizu.jpg" alt="" width="100%"></p>
                            <p><img src="static/meizu2.jpg" alt="" width="100%"></p>
                        </el-collapse-item>
                        <el-collapse-item title="乐视手机设置方法" name="7">
                            <p>打开「管家」-「省电管理」-「应用保护」，将 光氧运动App 开关置为打开状态。</p>
                            <p><img src="static/leshi.jpg" alt="" width="100%"></p>
                        </el-collapse-item>
                        <el-collapse-item title="三星手机设置方法" name="8">
                            <p>打开「设置」-「电池」-「省电模式」，确保为关闭状态。</p>
                            <p><img src="static/sanxing.jpg" alt="" width="100%"></p>
                        </el-collapse-item>
                    </el-collapse>
                </div>
            </el-collapse-item>
            <el-collapse-item title="被中断的运动记录，如何找回" name="9">
                <p class="content-indent">因为系统自动或者人工清理后台应用进程、手机没电关机、手机开启省电模式等因素导致运动中断，这些被中断的运动记录，应用都会记录下来。用户可以进入【历史运动概况】页面，查看到这些状态为 “非正常结束运动”的运动记录。被误杀的运动记录，在运动当天只支持查看运动轨迹，第二天凌晨3点过后，用户即可查看被误杀运动记录的完整运动数据。</p>
            </el-collapse-item>
            <el-collapse-item title="运动被中断了，会影响我本次运动达标吗" name="10">
                <p class="content-indent">因为被误杀的运动记录，在运动后的第二天凌晨，会由系统重新计算所有的运动数据。如果用户在应用被误杀前，运动数据已达标，则系统仍会判定这次运动达标。如果用户在应用被误杀前，运动数据未达标，则系统仍会判定这次运动未达标。</p>
            </el-collapse-item>
            <el-collapse-item title="为什么运动记录会被判定为异常" name="11">
                <p class="content-indent">在用户运动的过程中，应用会采集设备的轨迹、时间、步数等多种运动数据。系统将会综合运动过程中的多种数据，判断该次运动，是否未处于用户所在校方规定的正常运动范畴之内。如果未在范畴之内，则系统判定本次运动为异常，异常的运动记录，不能算作达标记录，异常运动记录内的耗时和消耗热量，也不能计入学生个人的累计运动时长和累计消耗热量两个统计项目中。</p>
            </el-collapse-item>
            <el-collapse-item title="为什么一天提交多次达标运动记录，但首页打卡数只增加1" name="12">
                <p class="content-indent">为了响应教育部的号召，满足高校的保障学生体质健康的需求，更好地保证学生在上学期间内充分参与课外体育锻炼。系统设定，一个学生在一天内可以提交多条达标运动记录，但只有第一条达标运动记录，才能算作完成校方的锻炼打卡要求，每个用户一天只能打卡1次。</p>
            </el-collapse-item>


            <p class="title"><i class="icon-title"></i>其他问题</p>
            <el-collapse-item title="使用说明" name="13">
                <p class="content-indent">本指南所描述的某些特性和功能，可能由于使用设备的差异、使用时的环境差异以及一些异常操作导致功能无法有效实现。您可以通过以下几种方式来获取帮助：</p>
                <p>1. 查阅指南。</p>
                <!-- <p>2. 联系校园客服：</p>
                <p class="content-indent">温州大学客服联系电话：</p>
                <p class="content-indent">温州职业技术学院客服联系电话：</p>
                <p class="content-indent">温州商学院客服联系电话：</p> -->
                <p>2. 向官方微信【光氧运动】认证服务号发起咨询。</p>
            </el-collapse-item>
            <el-collapse-item title="名词解释" name="14">
                <div class="content">
                    <p><strong>运动距离：</strong>运动距离是指从运动开始（时间）到运动结束（时间），身体移动过的地理距离。</p>
                    <p><strong>运动轨迹：</strong>运动训练学术语，是身体运动构成的重要因素。运动轨迹是指身体的某一部分从开始位置到结束为止所经过的路线组成的动作的空间特征。运动轨迹由运动轨迹方向、运动轨迹形式和运动幅度表示。</p>
                    <p><strong>运动时间：</strong>运动时间则是运动训练学术语，是身体运动构成的重要因素。身体运动时间是指人体完成运动动作所必需的时间，运动的时间与运动速度和运动节奏是密切联系在一起的。当距离一定的情况下，运动速度和运动节奏越快，则运动时间越短；运动速度和运动节奏越慢，则运动时间相应越长。</p>
                    <p><strong>运动速度：</strong>运动训练学术语，指身体或身体某一部分在单位时间内产生的位移距离。</p>
                    <p><strong>运动指标：</strong>
                        运动指标（Amount of exercise）也称“运动负荷”，指人体在体育活动中所承受的生理、心理负荷量以及消耗的热量，由完成练习的运动强度与持续时间，以及动作的准确性和运动方式特点等因素来决定运动指标的大小。
                        <p class="content-indent">从严格意义上讲，体育运动对人体产生的影响并不单纯取决于运动指标，而是运动负荷（“运动指标”只是一种通俗的叫法）。组成运动负荷的主要因素是；“量”和“强度”。</p>
                    </p>
                    <p><strong>卡路里：</strong>卡路里（简称卡，缩写为cal），由英文Calorie音译而来，其定义为在1个大气压下，将1克水提升1摄氏度所需要的热量。人类日常摄取的热量计算，以“卡路里”作为量度单位太小，所以现在的营养学和运动训练普遍采用千卡（俗称大卡，英文 kcal 或 Cal）为单位；1千卡（1大卡）等于1000卡路里，等于4186焦耳。本应用内使用的热量单位，也是千卡。</p>
                    <p><strong>热量消耗：</strong>人类身体能量消耗包括基础代谢、体力活动和食物的热效应三个方面，一般以大卡作为计量单位。
                        <ul>
                            <li>成人每日需要的热量 = 人体基础代谢的需要的基本热量 + 体力活动所需要的热量 + 消化食物所需要的热量。</li>
                            <li>消化食物所需要的热量 = 10% × （人体基础代谢的需要的最低热量 +体力活动所需要的热量）</li>
                            <li>成人每日需要的热量 = 1.1 × (人体基础代谢的需要的最低基本热量 +体力活动所需要的热量)</li>
                            <li>人体基础代谢的需要基本热量精确算法：
                                <p>女子</p>
                                <p>年龄 公式</p>
                                <p>18- 30岁 14.6 × 体重（kg） + 450</p>
                                <p>31- 60岁 8.6 ×体重（kg） + 830</p>
                                <p>60岁以上 10.4 × 体重（kg） + 600</p>
                                <p>男子</p>
                                <p>18- 30岁 15.2 × 体重（kg）+ 680</p>
                                <p>31- 60岁 11.5 × 体重（kg） + 830</p>
                                <p>60岁以上 13.4 × 体重（kg） + 490</p>
                            </li>
                            <li>体力活动所需要的热量：
                                <p>每小时体力活动消耗热量=（实际体重（kg）÷68（kg））×某运动方式1小时所消耗的卡路里</p>
                                <p>一段时间内体力活动消耗热量=（实际体重（kg）÷68（kg））×某运动方式1小时所消耗的卡路里×（实际运动时间（min）÷60（min））</p>
                                <p><img src="static/img3.png" alt="" width="100%"></p>
                            </li>
                        </ul>
                    </p>
                    <p><strong>步数：</strong>步数为用户在运动过程中，产生的步数。技术实现原理是应用通过手机内置的振动传感器或协助处理器，统计在运动过程中手机的震动频率得出的。</p>
                    <p><strong>步幅：</strong>步幅为一步的距离，以脚的中心算。人体走一步后，两脚中心的距离就是你的步幅。</p>
                    <p><strong>本学期累计运动次数：</strong>由校方设置，学生在本学期内需要达标完成的运动次数。</p>
                    <p><strong>耗时：</strong>是指系统记录的用户在本学期内已运动的总时长。</p>
                </div>
            </el-collapse-item>
            <el-collapse-item title="校园排行榜" name="15">
                <p>在【首页】，点击【校园排行榜】条目，就可以查看目前，本校累计消耗热量以及累计运动时长排名前100的学生。</p>
            </el-collapse-item>
            <el-collapse-item title="历史运动概况" name="16">
                <p class="content-indent">点击【个人中心】侧边弹窗内的【历史运动概况】，进入【历史运动概况】页面。</p>
                <p class="content-indent">在【历史运动概况】页面，可以查看本周、本月、本学期的历史运动记录。每条运动记录展示该次运动的运动方式、开始运动时间、完成距离、达标状态、耗时、消耗热量。</p>
                <p class="content-indent">所有的运动记录，都会按照日期区隔开显示。</p>
                <p class="content-indent">点击任意一条运动记录，即可进入该次运动的【锻炼成果】页。</p>
            </el-collapse-item>
            <el-collapse-item title="关于更新" name="17">
                <p>点击【个人中心】侧边弹窗内的【设置】>【检查更新】。</p>
                <p>如果系统检测到有新的版本，则会弹窗提示用户是否要更新。点击【是】，则手机开始下载新版本应用。</p>
            </el-collapse-item>

            <p class="title"><i class="icon-title"></i>服务条款与隐私说明</p>
            <el-collapse-item title="服务条款" name="18">
                <div class="content">
                    <p>更新于2017年08月26日</p>
                    <p class="content-indent">特别提示：在使用光氧运动内的锻炼方式，由各高校体育部门自行创建和管理。您在选择光氧运内的运动方式进行课外锻炼前，请先咨询健康专家您的身体状况是否适合此项运动。如有不适，请向学校体育部门进行沟通，寻求其他课外锻炼解决方案。因参与任何运动方式而引起的一切风险、损害及责任等，由您自行承担。</p>
                    <p class="content-indent">温州光氧网络科技有限公司（含其关联公司，以下称"光氧网络"或"我们"）为光氧运动App（以下称"光氧运动"或本应用）的实际开发者和运营者。光氧运动是一款校园运动 App，用户可以在应用内选择适宜自己的运动方式，进行日常课外锻炼。本服务条款构成我们与光氧运动用户（以下称"用户"或"您"）之间就光氧运动App提供的上述服务等事宜订立的契约，请仔细阅读本服务条款。</p>
                    <p class="content-indent">您激活账号成为光氧运动用户后，则即表示您同意接受本服务条款的约束，而本服务条款即构成对双方具有约束力的法律文件。</p>
                    <strong>1. 服务条款的确认及接受</strong>
                    <p>1.1 本应用的各项电子服务的所有权和运作权归光氧网络所有。您激活账号成为光氧运动用户后，即成为光氧运动的正式用户。用户确认：本服务条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。</p>
                    <p>1.2 您成功激活账号后，即视为您确认自己已具有与享受本应用提供的运动方式等服务相对应的权利能力和行为能力，并能够独立承担法律责任。</p>
                    <p>1.3 光氧网络保留在中华人民共和国大陆地区法现行法律法规允许的范围内自行决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单等的权利。</p>
                    <p>1.4 本应用的软件著作权及App上发布的所有信息与内容的版权均受中华人民共国著作权法（含相关法律、法规）乃至世界版权法律的保护。严禁未经授权对本应用内容进行复制、修改、汇编、改编或逆向工程。温州光氧网络科技有限公司保留所有未在本服务条款中明确授予的权利。</p>
                    <p>1.5 光氧网络通过互联网依法为用户提供互联网信息等服务，您在完全同意本服务条款、隐私条款及本应用其他规定（包括但不限于在本应用发布的所有规则及政策）的情况下，方有权使用本应用的相关服务。</p>
                    <p>1.6 用户必须自行准备如下设备并承担如下开支：（1）上网设备，包括并不限于电脑或者其他上网终端、调制解调器及其他必备的上网装置；（2）上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。</p>
                    <strong>2. 光氧运动账号激活规则</strong>
                    <p>2.1 您在光氧运动上的账号，由您所就读学校的体育部门进行创建，您的学号即为您的账号。账号激活资料包括但不限于您就读的学校、您的学号与您的姓名、密码等信息。</p>
                    <p>2.2 在激活光氧运动账号时，用户应承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线，且保证在激活及使用光氧运动账号时，不得有以下情形：</p>
                    <p class="content-indent">（1）违反宪法或法律法规规定的；</p>
                    <p class="content-indent">（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
                    <p class="content-indent">（3）损害国家荣誉和利益的，损害公共利益的；</p>
                    <p class="content-indent">（4）煽动民族仇恨、民族歧视，破坏民族团结的；</p>
                    <p class="content-indent">（5）破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
                    <p class="content-indent">（6）散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
                    <p class="content-indent">（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
                    <p class="content-indent">（8）侮辱或者诽谤他人，侵害他人合法权益的；</p>
                    <p class="content-indent">（9）含有法律、行政法规禁止的其他内容或违反光氧运动的其他规定的。</p>
                    <p>2.3 用户应保证其提供的激活资料真实、准确、完整、合法有效，用户的账号资料如有变动的，应及时更新。因用户提供的激活资料不符合本条款约定而引起的一切责任及后果，由用户自行承担，且光氧网络保留终止用户使用光氧运动各项服务的权利。</p>
                    <p>2.4 对激活并冒用他人学号的用户，光氧网络有权注销其账号，并向互联网信息内容主管部门报告。</p>
                    <p>2.5 用户成功激活账号后，将产生密码信息，您可以根据本应用规定更改您的密码。用户应谨慎合理的保存、使用其用账号和密码。用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通知本应用并向公安机关报案。因用户未妥善保管其账户名称及密码而导致第三人使用账户而给用户造成的损失，由用户自行承担。</p>
                    <p>2.6 您的光氧运动账户仅限于您自己使用，严禁将您的光氧运动账户允许第三人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。</p>
                    <p>2.7 依据相关法律法规的规定，光氧网络有权对激活账号的用户进行基于移动电话号码、电子邮箱、微信等真实身份信息认证。对于拒绝进行真实身份信息认证的用户，光氧网络保留拒绝此用户使用光氧运动相关服务的权利并有权对用户进行包括但不限于限制服务使用、关闭账号等的处理。 </p>
                    <strong>3. 用户隐私制度</strong>
                    <p>3.1 用户知悉并同意，为了记录用户训练的真实数据以及在保障用户账号安全，我们在您自愿的前提下收集您的个人信息并将这些信息进行整合，包括但不限于激活账号时的相关信息、微信账号信息；各高校体育部门在开通服务时，上传的您的个人身体数据（身高、体重、健康数据等）；以及您在使用设备运动时，记录的设备ID、GPS定位数据、轨迹数据、耗时数据等。</p>
                    <p>3.2 尊重用户个人隐私是光氧运动的一项基本政策。所以，光氧运动不会公开或向任何第三方透露用户的账号资料以及用户因享受光氧运动服务而提供的任何信息，但以下情形除外：</p>
                    <p class="content-indent">（1）事先获得用户的明确授权或许可；</p>
                    <p class="content-indent">（2）遵守有关法律规定，包括在国家有关机关查询时，提供用户的激活信息、互联网地址或者域名等；</p>
                    <p class="content-indent">（3）在紧急情况下竭力维护用户个人和社会大众的隐私安全；</p>
                    <p class="content-indent">（4）根据本条款相关规定或者光氧运动认为必要的其他情形。</p>
                    <p class="content-indent">光氧运动可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与光氧运动同等的保护用户隐私的责任，则光氧运动可将用户信息提供给该第三方。</p>
                    <strong>4. 所有权及知识产权条款</strong>
                    <p>4.1 光氧网络（含其关联企业）是光氧运动App的所有者及运营者，拥有光氧运动App内容、资源及软件的著作权等合法权利，受国家法律保护，有权不时地对本服务条款、光氧运动App版本及内容进行修改或更新，并在App内张贴或直接更新，无须另行通知用户。在法律允许的最大限度范围内，光氧网络（含其关联企业）对本条款及光氧运动App内容拥有解释权。</p>
                    <p>4.2 除法律另有强制性规定外，未经光氧网络（含其关联企业）明确的特别书面许可，任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本应用及光氧运动App内的信息内容，否则，光氧网络有权追究其法律责任。</p>
                    <p>4.3 本应用及光氧运动App内所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、 数字下载、数据编辑和软件），均是光氧网络或其内容提供者的财产，受中华人民共和国和国际版权法及相关法律法规的保护；上述内容的汇编是光氧网络的排他财产，受中华人民共和国和国际版权法及相关法律法规的保护；本应用上所有软件都是光氧网络（含其关联公司）的财产，受中华人民共和国和国际版权法及相关法律法规的保护。</p>
                    <strong>5. 责任限制及不承诺担保</strong>
                    <p>5.1 除非另有明确的书面说明，本应用及其所包含的或以其它方式通过本应用提供给您的全部信息、内容、材料、产品（包括软件）和服务，均是在"按现状"和"按现有"的基础上提供的。</p>
                    <p>5.2 除非另有明确的书面说明，我们不对本应用的运营及其包含在本应用上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。</p>
                    <p>5.3 我们不担保本应用所包含的或以其它方式通过本应用提供给您的全部信息、内容、材料、产品（包括软件）和服务、其服务器或从本应用发出的电子信件、信息没有病毒或其他有害成分。</p>
                    <p>5.4 如因不可抗力或其它本应用无法控制的原因使本应用服务系统崩溃或无法正常使用导致服务不可用或网上交易无法完成或丢失有关的信息、记录等，我们会合理地尽力协助处理善后事宜。</p>
                    <strong>6. 协议更新及用户关注义务</strong>
                    <p class="content-indent">根据国家法律法规的更新及网站运营需要，我们有权对本条款不时地进行修改，修改后的服务条款一旦被张贴在本应用上即生效力，并代替原来的服务条款。用户可随时登录查阅最新服务条款内容。如用户不同意更新后的服务条款，应立即停止接受本应用提供的服务；如用户继续使用本应用提供的服务，即视为同意更新后的服务条款。我们建议您在使用本应用之前阅读本服务条款及本应用的公告。如果本服务条款中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。</p>
                    <strong>7. 法律管辖和适用</strong>
                    <p class="content-indent">本服务条款的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区现行之有效法律。 如发生本服务条款的某些内容与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。如缔约方就本条款内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向有管辖权的中华人民共和国大陆地区法院提起诉讼。</p>
                    <strong>8. 其他</strong>
                    <p>8.1 光氧运动的所有者是指在政府部门依法许可或备案的光氧运动App的经营主体。</p>
                    <p>8.2 我们尊重用户和消费者的合法权利，本服务条款及本应用上发布的各类规则、政策、声明等其他内容，均是为了更好的、更加便利的为用户和消费者提供服务。光氧运动欢迎用户和社会各界提出意见和建议，您可以通过以下微信认证服务号【光氧运动】联系我们，我们将虚心接受并适时修改本服务条款及相关政策、规则。</p>
                    <p>8.3 本协议内容中以黑体、加粗等方式显著标识的条款，请用户着重阅读。</p>
                    <p>8.4 您完成激活成为光氧运动的用户则意味着您完全接受本服务条款，在激活之前请您再次确认已知悉并完全理解本服务条款的全部内容。</p>
                </div>
            </el-collapse-item>
            <el-collapse-item title="隐私说明" name="19">
                <div class="content">
                    <strong>引言</strong>
                    <p class="content-indent">温州光氧网络科技有限公司（含其关联公司，以下称"光氧网络"或"我们"）重视您的隐私。您在使用我们的服务时，我们可能会收集和使用您的信息。我们希望通过本《个人信息保护声明》向您说明在您使用我们的服务时，我们如何收集、使用、储存和分享这些信息，以及我们为您提供的访问、更新、控制和保护这些信息的方式。本《个人信息保护声明》与您所使用的本单位服务息息相关，我们也希望您能够仔细阅读，并在需要时，按照本《个人信息保护声明》的指引，作出您认为适当的选择。本《个人信息保护声明》之中涉及的相关技术词汇，我们尽量以简明扼要的表述向您解释，并提供了进一步说明的链接，以便您的理解。为了使您充分理解本声明，本声明中与您的权益存在或可能存在重大关系的条款，我们已采用加粗字体提醒您注意。</p>
                    <p class="content-indent">您使用或继续使用我们的服务，都表示您同意我们按照本《个人信息保护声明》收集、使用、储存和分享您的信息。</p>
                    <p class="content-indent">如您对本《个人信息保护声明》或与本《个人信息保护声明》相关的事宜有任何问题，请通过 与我们联系。</p>
                    <strong>我们收集的信息</strong>
                    <p class="content-indent">我们提供服务时，可能会收集、储存和使用下列与您有关的信息。如果您不提供相关信息，可能无法注册成为我们的用户、享受我们提供的某些服务，或者即便我们可以继续向您提供一些服务，也无法达到该服务拟达到的效果。</p>
                    <strong>您提供的信息</strong>
                    <p class="content-indent">您在激活我们的账户时，向我们提供的相关个人信息，例如学校、学号、姓名、密码以及微信账号等；</p>
                    <strong>我们获取的您的信息</strong>
                    <p class="content-indent">您在激活我们的账户时，向我们提供的相关个人信息，例如学校、学号、姓名、密码以及微信账号等；</p>
                    <p class="content-indent">您使用我们服务时我们可能收集如下信息：</p>
                    <p class="content-indent">日志信息指您使用我们服务时，系统可能自动采集的技术信息，包括：</p>
                    <p class="content-indent">设备或软件信息，例如您的移动设备、网页浏览器或您用于接入我们的服务的其他程序所提供的配置信息、您的IP地址和您的移动设备所用的版本和设备识别码；</p>
                    <p class="content-indent">您在使用我们服务时浏览或要求提供的信息和内容详情；</p>
                    <p class="content-indent">位置信息指您开启设备定位功能并使用我们基于位置提供的相关服务时，我们收集的有关您位置的信息，包括：</p>
                    <p class="content-indent">您通过具有定位功能的移动设备使用我们的服务时，我们通过GPS或WiFi等方式收集的您的地理位置信息；</p>
                    <p class="content-indent">您可以通过关闭定位功能随时停止我们对您的地理位置信息的收集                    </p>
                    <strong>我们如何使用您的信息</strong>
                    <p class="content-indent">我们可能将在向您提供服务的过程之中所收集的信息用作下列用途：</p>
                    <p class="content-indent">向您提供服务；</p>
                    <p class="content-indent">在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性；</p>
                    <p class="content-indent">帮助我们设计新服务，改善我们现有服务；</p>
                    <p class="content-indent">使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如语言设定、位置设定、个性化的帮助服务和指示，或对您和其他使用我们服务的用户作出其他方面的回应；</p>
                    <p class="content-indent">软件认证或管理软件升级；</p>
                    <strong>如何访问和控制您的信息</strong>
                    <p class="content-indent">我们将尽量采取适当的技术手段，保证您可以访问、更新和更正您的账号信息或使用我们的服务时提供的其他个人信息。在访问、更新、更正和删除您的个人信息时，我们可能会要求您进行身份验证，以保障您的账户安全。</p>
                    <strong>我们如何分享您的信息</strong>
                    <p class="content-indent">尊重用户个人隐私是光氧运动的一项基本政策。所以，光氧运动不会公开或向任何第三方透露用户的账号资料以及用户因享受光氧运动服务而提供的任何信息，但以下情形除外：</p>
                    <p class="content-indent">（1）事先获得用户的明确授权或许可；</p>
                    <p class="content-indent">（2）遵守有关法律规定，包括在国家有关机关查询时，提供用户的激活信息、互联网地址或者域名等；</p>
                    <p class="content-indent">（3）在紧急情况下竭力维护用户个人和社会大众的隐私安全；</p>
                    <p class="content-indent">（4）根据本条款相关规定或者光氧运动认为必要的其他情形。</p>
                    <p class="content-indent">光氧运动可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与光氧运动同等的保护用户隐私的责任，则光氧运动可将用户信息提供给该第三方</p>
                    <strong>我们如何保留、储存和保护您的信息</strong>
                    <p class="content-indent">我们仅在本《个人信息保护声明》所述目的所必需期间和法律法规要求的时限内保留您的个人信息。</p>
                    <p class="content-indent">我们使用各种安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露。例如，在某些服务中，我们将利用加密技术（例如SSL）来保护您向我们提供的个人信息。但请您谅解，由于技术的限制以及风险防范的局限，即便我们已经尽量加强安全措施，也无法始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的情况而发生问题。</p>
                    <strong>有关敏感个人信息的提示</strong>
                    <p class="content-indent">您的个人身体数据以及运动数据，因其特殊性可能被认为是敏感个人信息，敏感个人信息受到更加严格的保护。</p>
                    <p class="content-indent">请注意，您在我们的服务中所提供、上传或发布的内容和信息（例如有关您社交活动的照片或信息），可能会泄露您的敏感个人信息。您激活账号成为光氧运动用户后，则即表示您同意您的敏感个人信息按本《个人信息保护声明》所述的目的和方式来处理。</p>
                    <strong>我们向您发送的邮件和信息</strong>
                    <p class="content-indent">信息推送</p>
                    <p class="content-indent">您在激活个人账号之前，需要关注我们的微信认证服务号【光氧运动】。在您使用我们服务时，我们可能使用您的信息向您的微信账号发送消息。</p>
                    <p class="content-indent">与服务有关的公告</p>
                    <p class="content-indent">我们可能在必需时（例如当我们由于系统维护而暂停某一项服务时）向您发出与服务有关的公告。</p>
                    <strong>年龄限制</strong>    
                    <p class="content-indent">我们鼓励父母或监护人指导未满十八岁的未成年人使用我们的服务。我们建议未成年人鼓励他们的父母或监护人阅读本《个人信息保护声明》，并建议未成年人在提交的个人信息之前寻求父母或监护人的同意和指导。</p>
                    <strong>本《个人信息保护声明》的适用范围</strong>    
                    <p class="content-indent">除某些特定服务外，我们所有的服务均适用本《个人信息保护声明》。这些特定服务将适用特定的个人信息保护声明。该特定服务的个人信息保护声明构成本《个人信息保护声明》的一部分。如任何特定服务的个人信息保护声明与本《个人信息保护声明》有不一致之处，则适用特定服务的个人信息保护声明。</p>
                    <p class="content-indent">除本《个人信息保护声明》另有规定外，本《隐私条款》所用词语将与《本单位服务协议》所定义的词语具有相同的涵义。</p>
                    <strong>本《个人信息保护声明》的修改</strong>
                    <p class="content-indent">我们可能随时修改本《个人信息保护声明》的条款，该等修改构成本《个人信息保护声明》的一部分。如该等修改造成您在本《个人信息保护声明》下权利的实质减少，我们将在修改生效前通过在主页上显著位置提示或向您发送电子邮件或以其他方式通知您，在该种情况下，若您继续使用我们的服务，即表示同意受经修订的本《个人信息保护声明》的约束。</p>
                    <strong>定义</strong>
                    <p class="content-indent">个人信息</p>
                    <p class="content-indent">任何可用于单独或结合其他信息识别您的个人身份的信息，或与您的个人身份相关的隐私信息。</p>
                </div>                    
            </el-collapse-item>
        </el-collapse>
    </div>
</template>

<script>
    import resources from '../resources'

    export default {
        data() {
            return {
                activeNames: [],
                activeNames2: []
            };
        },
        methods: {
            handleChange() {
            }
        },
        mounted: function () {
        }
    }

</script>

<style lang="scss" scoped>
    .help-page {
        font-size: 20px;
        p {
            margin: 0;
            padding: 0;
        }
        .title {
            margin: 0;
            padding: 10px;
            line-height: 35px;
            background-color: #f0f0f2;
        }
        .icon-title {
            width: 6px;
            height: 20px;
            display: inline-block;
            background-color: #66A6FF;
            margin-right: 10px;
            vertical-align: middle;
        }
        .content {
            max-height: 550px;
            overflow: scroll;
        }
        .content-indent {
            text-indent: 2em;
        }
        .el-collapse {
            font-size: 12px;
        }
    }
</style>